wisteria-1c/Конфигурация/Catalogs/ИнтервалыДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИнтервалыДоставки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.СлужбыДоставки</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВремяДоставкиС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяДоставкиПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЯндекса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

wisteria-1c/Конфигурация/Catalogs/ИнтервалыДоставки/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.ИдентификаторЯндекса) Тогда
		УстановитьПредупреждениеПриРедактировании(Элементы.ВремяДоставкиС);
		УстановитьПредупреждениеПриРедактировании(Элементы.ВремяДоставкиПо);
	КонецЕсли;
	
	АдаптацияТакси();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АдаптацияТакси()
	
	Интерфейс8_5 = ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	ИнтерфейсТакси = Не Интерфейс8_5;
	
	Если ИнтерфейсТакси Тогда
		
		Элементы.ВремяДоставкиС.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
		Элементы.ВремяДоставкиПо.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПредупреждениеПриРедактировании(Элемент)
	
	Элемент.ПредупреждениеПриРедактировании = НСтр("ru = 'Изменять интервал Яндекс.Доставки не рекомендуется.'");
	
КонецПроцедуры

#КонецОбласти
